InformationRegisters/СчетаРеглУчетаТребующиеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СчетаРеглУчетаТребующиеНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкаСчетовУчетаАналитикаУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкаСчетовУчетаМестоУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовРеглУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Долгосрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетаРеглУчетаТребующиеНастройки/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ВидыСчетовЗаписываемыеВРегистрТребующихсяНастроек = РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.НастраиваемыеВидыСчетов();
	МассивЗаписейДляУдаления = Новый Массив;
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	ШаблонСообщения = НСтр("ru = 'При записи счетов требующих настроек, ошибка: для вида счета ""%1""'", КодОсновногоЯзыка);
	ОбъектМетаданных = Метаданные.РегистрыСведений.СчетаРеглУчетаТребующиеНастройки;
	ОтражаемыйДокумент = Неопределено;
	ДополнительныеСвойства.Свойство("Документ", ОтражаемыйДокумент);
	
	Для каждого СтрокаРегистра Из ЭтотОбъект Цикл
		
		ЗаписьДобавлена = Ложь;
		
		Если ВидыСчетовЗаписываемыеВРегистрТребующихсяНастроек.Найти(СтрокаРегистра.ВидСчета) = Неопределено Тогда
			// Данный вид счета не настраивается в рабочем месте, поэтому его запись в данный регистр не имеет смысла.
			МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
			Продолжить;
		КонецЕсли;
		
		ОбязательныеИзмеренияРегистра = РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.СписокИзмеренийРегистраПоВидуСчета(СтрокаРегистра.ВидСчета, Истина);
		ОбязательныеИзмеренияРегистра.Добавить("ВидСчета");
		
		Для каждого ИзмерениеРегистра Из ОбязательныеИзмеренияРегистра Цикл
			Если Не ЗначениеЗаполнено(СтрокаРегистра[ИзмерениеРегистра]) Тогда
				ТекстСообщения = ШаблонСообщения + " " + НСтр("ru = 'не заполнено измерение регистра ""%2"".'", КодОсновногоЯзыка);
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаРегистра.ВидСчета, ИзмерениеРегистра);
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отражение в регламентированном учете'", КодОсновногоЯзыка),
					УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, ОтражаемыйДокумент, ТекстСообщения);
				МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
				ЗаписьДобавлена = Истина;
			КонецЕсли;
		КонецЦикла;
		
		РазделУчета = НастройкаСчетовУчетаКлиентСервер.РазделУчетаПоИмениСчета(XMLСтрока(СтрокаРегистра.ВидСчета));
		ОграничениеТипаМестоУчета = НастройкаСчетовУчетаСервер.НастройкиМестаУчетаПоРазделуУчета(РазделУчета).ТипЗначения;
		Если ОграничениеТипаМестоУчета <> Неопределено И Не ОграничениеТипаМестоУчета.СодержитТип(ТипЗнч(СтрокаРегистра.МестоУчета)) И Не РазделУчета = "Номенклатура" Тогда
			ТекстСообщения = ШаблонСообщения + " " + НСтр("ru = 'тип значения измерения ""Место учета"" (%2) не соответствует требуемому.'", КодОсновногоЯзыка);
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаРегистра.ВидСчета, ТипЗнч(СтрокаРегистра.МестоУчета));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отражение в регламентированном учете'", КодОсновногоЯзыка),
				УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, ОтражаемыйДокумент, ТекстСообщения);
			Если Не ЗаписьДобавлена Тогда
				МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
				ЗаписьДобавлена = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ОграничениеТипаАналитикаУчета = НастройкаСчетовУчетаСервер.НастройкиАналитикиУчетаПоРазделуУчета(РазделУчета).ТипЗначения;
		Если ОграничениеТипаАналитикаУчета <> Неопределено И Не ОграничениеТипаАналитикаУчета.СодержитТип(ТипЗнч(СтрокаРегистра.АналитикаУчета)) Тогда
			ТекстСообщения = ШаблонСообщения + " " + НСтр("ru = 'тип значения измерения ""Аналитика учета"" (%2) не соответствует требуемому.'", КодОсновногоЯзыка);
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаРегистра.ВидСчета, ТипЗнч(СтрокаРегистра.АналитикаУчета));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отражение в регламентированном учете'", КодОсновногоЯзыка),
				УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, ОтражаемыйДокумент, ТекстСообщения);
			Если Не ЗаписьДобавлена Тогда
				МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
				ЗаписьДобавлена = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивЗаписейДляУдаления.Количество() Тогда
		Для каждого ЗаписьДляУдаления Из МассивЗаписейДляУдаления Цикл
			ЭтотОбъект.Удалить(ЗаписьДляУдаления);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
